// 1. location -> function:
MATCH (n:OPERATIONS) WHERE n.location[1] CONTAINS 'window.c' AND n.location[2] = '5841' LIMIT 1
MATCH (n) (()<-[:CHILDINST]-()<-[:CHILDBLOCK]-()<-[:CHILDREGION]-()){1,} (func {name: "hl.func"}) RETURN func.uid, func.hash, func.func_name;
+-----------------------------------------------------------------------+
| func.uid | func.hash            | func.func_name                      |
+-----------------------------------------------------------------------+
| 4499831  | -2825872045683958041 | "win_free(window_S *, tabpage_S *)" |
+-----------------------------------------------------------------------+

// 2. caller
MATCH (:STRINGATTRS {hash: -2825872045683958041})<-[:ARGATTR]-(call {name: "hl.call"}) 
(()<-[:CHILDINST]-()<-[:CHILDBLOCK]-()<-[:CHILDREGION]-()){1,} (caller {name: "hl.func"})
WITH caller, collect(call.location) AS call_locs
RETURN caller.func_name, caller.location, caller.uid, caller.hash, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+-------------------------------------------------------------------------------------------------------------------------------------+
| caller.func_name                                      | caller.location                | caller.uid | caller.hash          | macros |
+-------------------------------------------------------------------------------------------------------------------------------------+
| "win_free_popup(window_S *)"                          | ["F", "window.c", "5940", "1"] | 4541071    | -8789911548485253750 | []     |
| "win_split_ins(int, int, window_S *, int, frame_S *)" | ["F", "window.c", "976", "1"]  | 4506358    | 6925504674362713454  | []     |
| "win_free_mem(window_S *, int *, tabpage_S *)"        | ["F", "window.c", "23", "15"]  | 4463276    | 6374325599304741934  | []     |
+-------------------------------------------------------------------------------------------------------------------------------------+

// 3. caller -> callee
MATCH (caller:OPERATIONS {uid: 4541071}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (call {name: 'hl.call'})
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->()
RETURN callee.func_name, callee.location, callee.uid, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+-----------------------------------------------------------------------------------------------------------------+
| callee.func_name                                         | callee.location                | callee.uid | macros |
+-----------------------------------------------------------------------------------------------------------------+
| "win_free(window_S *, tabpage_S *)"                      | ["F", "window.c", "47", "13"]  | 4499831    | []     |
| "vim_free(void *)"                                       | ["F", "alloc.c", "609", "1"]   | 422160     | []     |
| "close_buffer(window_S *, file_buffer *, int, int, int)" | ["F", "buffer.c", "523", "1"]  | 503884     | []     |
| "bt_popup(file_buffer *)"                                | ["F", "buffer.c", "5854", "1"] | 600666     | []     |
| "win_close_buffer(window_S *, int, int)"                 | ["F", "window.c", "2635", "1"] | 4517394    | []     |
| "timer_valid(timer_S *)"                                 | ["F", "time.c", "790", "1"]    | 3793502    | []     |
| "stop_timer(timer_S *)"                                  | ["F", "time.c", "689", "1"]    | 3825472    | []     |
+-----------------------------------------------------------------------------------------------------------------+

// 4. caller -> callee -> callee
MATCH (caller:OPERATIONS {uid: 503884}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (call {name: 'hl.call'})
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->()
RETURN callee.func_name, callee.location, callee.uid, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                                   | callee.location                  | callee.uid | macros                                                                                                                                           |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "set_bufref($struct@<./structs.h:98:9> *, file_buffer *)"                          | ["F", "buffer.c", "408", "1"]    | 542818     | []                                                                                                                                               |
| "buf_freeall(file_buffer *, int)"                                                  | ["F", "buffer.c", "841", "1"]    | 573403     | []                                                                                                                                               |
| "aborting()"                                                                       | ["F", "ex_eval.c", "90", "1"]    | 1364061    | []                                                                                                                                               |
| "bufref_valid($struct@<./structs.h:98:9> *)"                                       | ["F", "buffer.c", "423", "1"]    | 504372     | []                                                                                                                                               |
| "end_visual_mode()"                                                                | ["F", "normal.c", "1128", "1"]   | 2439732    | []                                                                                                                                               |
| "diff_buf_delete(file_buffer *)"                                                   | ["F", "diff.c", "117", "1"]      | 852333     | []                                                                                                                                               |
| "diffopt_hiddenoff()"                                                              | ["F", "diff.c", "2433", "1"]     | 875800     | []                                                                                                                                               |
| "unblock_autocmds()"                                                               | ["F", "autocmd.c", "2553", "1"]  | 529163     | []                                                                                                                                               |
| "goto_tabpage_win(tabpage_S *, window_S *)"                                        | ["F", "window.c", "5115", "1"]   | 4531512    | []                                                                                                                                               |
| "block_autocmds()"                                                                 | ["F", "autocmd.c", "2535", "1"]  | 523437     | []                                                                                                                                               |
| "win_valid_any_tab(window_S *)"                                                    | ["F", "window.c", "1665", "1"]   | 4507968    | []                                                                                                                                               |
| "emsg(char *)"                                                                     | ["F", "message.c", "785", "1"]   | 460316     | []                                                                                                                                               |
| "apply_autocmds(auto_event, unsigned char *, unsigned char *, int, file_buffer *)" | ["F", "autocmd.c", "1861", "1"]  | 533623     | []                                                                                                                                               |
| "one_window()"                                                                     | ["F", "window.c", "2569", "1"]   | 4511468    | []                                                                                                                                               |
| "buflist_setfpos(file_buffer *, window_S *, long, int, int)"                       | ["F", "buffer.c", "3115", "1"]   | 551059     | []                                                                                                                                               |
| "set_last_cursor(window_S *)"                                                      | ["F", "mark.c", "1409", "1"]     | 2068104    | []                                                                                                                                               |
| "can_unload_buffer(file_buffer *)"                                                 | ["F", "buffer.c", "475", "1"]    | 528190     | []                                                                                                                                               |
| "bt_terminal(file_buffer *)"                                                       | ["F", "buffer.c", "5822", "1"]   | 610246     | []                                                                                                                                               |
| "term_job_running(terminal_S *)"                                                   | ["F", "terminal.c", "1773", "1"] | 3832020    | []                                                                                                                                               |
| "free_terminal(file_buffer *)"                                                     | ["F", "terminal.c", "1174", "1"] | 3621886    | []                                                                                                                                               |
| "buf_clear_file(file_buffer *)"                                                    | ["F", "buffer.c", "813", "1"]    | 573251     | []                                                                                                                                               |
| "free_buffer(file_buffer *)"                                                       | ["F", "buffer.c", "49", "13"]    | 503185     | []                                                                                                                                               |
| "mark_forget_file(window_S *, int)"                                                | ["F", "mark.c", "137", "1"]      | 2015100    | []                                                                                                                                               |
| "ga_init2(growarray *, unsigned long, int)"                                        | ["F", "alloc.c", "698", "1"]     | 421202     | []                                                                                                                                               |
| "ga_grow(growarray *, int)"                                                        | ["F", "alloc.c", "710", "1"]     | 421253     | []                                                                                                                                               |
| "vim_free(void *)"                                                                 | ["F", "alloc.c", "609", "1"]     | 422160     | [["M", "2", "F", "buffer.c", "773", "6", "F", "./macros.h", "365", "6"], ["M", "2", "F", "buffer.c", "776", "2", "F", "./macros.h", "365", "6"]] |
| "free_buffer_stuff(file_buffer *, int)"                                            | ["F", "buffer.c", "50", "13"]    | 503395     | []                                                                                                                                               |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 5. caller -> callee -> callee -> callee
MATCH (caller:OPERATIONS {uid: 2015100}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (call {name: 'hl.call'})
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->()
RETURN callee.func_name, callee.location, callee.uid, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+--------------------------------------------------------------------------------------+
| callee.func_name                | callee.location              | callee.uid | macros |
+--------------------------------------------------------------------------------------+
| "vim_free(void *)"              | ["F", "alloc.c", "609", "1"] | 422160     | []     |
| "tagstack_clear_entry(taggy *)" | ["F", "tag.c", "4241", "1"]  | 3568627    | []     |
+--------------------------------------------------------------------------------------+

// 6. caller -> callee -> callee -> callee -> callee
MATCH (caller:OPERATIONS {uid: 3568627}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (call {name: 'hl.call'})
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->()
RETURN callee.func_name, callee.location, callee.uid, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name   | callee.location              | callee.uid | macros                                                                                                                                       |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "vim_free(void *)" | ["F", "alloc.c", "609", "1"] | 422160     | [["M", "2", "F", "tag.c", "4243", "5", "F", "./macros.h", "365", "6"], ["M", "2", "F", "tag.c", "4244", "5", "F", "./macros.h", "365", "6"]] |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
