// 1. vulnerability location -> operation
MATCH (n:OPERATIONS) WHERE n.location[1] CONTAINS 'eapsimlib.c' AND n.location[2] = '341' RETURN n;
+------------------------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                                  |
+------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.cast", uid: 603192, location: ["F", "src/modules/rlm_eap/libeap/eapsimlib.c", "341", "33"], castKind: 26}) |
| (:OPERATIONS {name: "hl.ref", uid: 603186, location: ["F", "src/modules/rlm_eap/libeap/eapsimlib.c", "341", "22"]})                |
| (:OPERATIONS {name: "hl.cast", uid: 603200, location: ["F", "src/modules/rlm_eap/libeap/eapsimlib.c", "341", "3"], castKind: 4})   |
| (:OPERATIONS {name: "hl.sub", uid: 603194, location: ["F", "src/modules/rlm_eap/libeap/eapsimlib.c", "341", "32"]})                |
| (:OPERATIONS {name: "hl.cast", uid: 603188, location: ["F", "src/modules/rlm_eap/libeap/eapsimlib.c", "341", "22"], castKind: 4})  |
| (:OPERATIONS {name: "hl.cast", uid: 603196, location: ["F", "src/modules/rlm_eap/libeap/eapsimlib.c", "341", "22"], castKind: 26}) |
| (:OPERATIONS {name: "hl.const", uid: 603190, location: ["F", "src/modules/rlm_eap/libeap/eapsimlib.c", "341", "33"], val_kind: 3}) |
| (:OPERATIONS {name: "hl.assign", uid: 603204, location: ["F", "src/modules/rlm_eap/libeap/eapsimlib.c", "341", "20"]})             |
| (:OPERATIONS {name: "hl.ref", uid: 603198, location: ["F", "src/modules/rlm_eap/libeap/eapsimlib.c", "341", "3"]})                 |
+------------------------------------------------------------------------------------------------------------------------------------+

// 2. backward
MATCH (:OPERATIONS {uid: 603204})-[:ARGVALUE {idx: 1}]->() (()<-[:RESVALUE]-()-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def) 
WHERE def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call" RETURN def, def_v;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                                                   | def_v                   |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 584790, varName: "newvp", has_init: FALSE, name: "hl.var", variable_sizes: 0, location: ["F", "src/modules/rlm_eap/libeap/eapsimlib.c", "287", "14"], hash: -8959531735244199600}) | (:VALUES {uid: 584791}) |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 3. forward
// NOTE: forward as return
MATCH (:VALUES {uid: 584791}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[:ARGVALUE {idx: 1}]-({name: "hl.assign"})-[:ARGVALUE {idx: 0}]->(value)
MATCH (value) (()<-[:RESVALUE]-()-[:ARGVALUE]->()){0,} ()<-[:RESVALUE]-(call {name: "hl.call"})
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+----------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                        | callee.location                      | callee.uid | macros |
+----------------------------------------------------------------------------------------------------------------------+
| "fr_pair_afrom_num(void *, unsigned int, unsigned int)" | ["F", "src/lib/pair.c", "119", "13"] | 168055     | []     |
+----------------------------------------------------------------------------------------------------------------------+
