// 1. location
MATCH (n:OPERATIONS {name: "hl.call"}) WHERE n.location[1] CONTAINS 'msl.c' AND n.location[2] = '7955' RETURN n;
+----------------------------------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                                            |
+----------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 7524878, can_throw: TRUE, location: ["F", "coders/msl.c", "7955", "13"], within: FALSE, cleanup: FALSE}) |
+----------------------------------------------------------------------------------------------------------------------------------------------+

// 2. backward
MATCH (:OPERATIONS {uid: 7524878})-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def) 
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                              | def_v                    |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 7524477, varName: "msl_image", has_init: FALSE, name: "hl.var", variable_sizes: 0, location: ["F", "coders/msl.c", "7942", "6"], hash: -1991982133175541804}) | (:VALUES {uid: 7524478}) |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 3. forward
MATCH (:VALUES {uid: 7524478}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[arg:ARGVALUE]-(call {name: "hl.call"}) 
WHERE (call.location[0] = 'F' AND toInteger(call.location[2]) < 7955) OR (call.location[0] = 'M' AND toInteger(call.location[4]) < 7955)
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT arg.idx) AS arg_idx, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, arg_idx, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+-------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                    | callee.location                     | callee.uid | arg_idx | macros |
+-------------------------------------------------------------------------------------------------------------------------------------------+
| "ProcessMSLScript(const _ImageInfo *, _Image **, _ExceptionInfo *)" | ["F", "coders/msl.c", "7386", "26"] | 7534215    | [1]     | []     |
+-------------------------------------------------------------------------------------------------------------------------------------------+

// 4. forward
MATCH (:OPERATIONS {uid: 7534215})-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST {idx: 0}]->(first)
MATCH (first) (()-[:NEXTOP]->(mid) WHERE mid.name <> 'hl.param'){0,} (first_param)
MATCH (first_param) (()-[:NEXTOP]->()){1,1} (param)-[:RESVALUE]->(param_v)
RETURN param, param_v;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| param                                                                                                                                             | param_v                  |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.param", uid: 7534218, prime_type: "typedef Image **", location: ["F", "coders/msl.c", "7387", "11"], paramName: "image"}) | (:VALUES {uid: 7534219}) |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
MATCH (:VALUES {uid: 7534219}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[arg:ARGVALUE]-(call {name: "hl.call"}) 
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT arg.idx) AS arg_idx, collect(DISTINCT call) AS calls
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, arg_idx, [call IN calls | call.uid] AS calls, [call IN calls | call.location] AS call_locs;
+-----------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                     | callee.location                    | callee.uid | arg_idx | calls     | call_locs                            |
+-----------------------------------------------------------------------------------------------------------------------------------------------------+
| "MSLPushImage(_MSLInfo *, _Image *)" | ["F", "coders/msl.c", "245", "16"] | 7518488    | [1]     | [7541255] | [["F", "coders/msl.c", "7465", "5"]] |
+-----------------------------------------------------------------------------------------------------------------------------------------------------+

// 5. forward
// NOTE: forward as pointee alias
MATCH (:OPERATIONS {uid: 7518488})-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST {idx: 0}]->(first)
MATCH (first) (()-[:NEXTOP]->(mid) WHERE mid.name <> 'hl.param'){0,} (first_param {name: "hl.param"})
MATCH (first_param) (()-[:NEXTOP]->()){1,1} (param)-[:RESVALUE]->(param_v)
RETURN param, param_v;
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| param                                                                                                                                           | param_v                  |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.param", uid: 7518491, prime_type: "typedef Image *", location: ["F", "coders/msl.c", "245", "54"], paramName: "image"}) | (:VALUES {uid: 7518492}) |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
MATCH (:VALUES {uid: 7518492}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[arg:ARGVALUE {idx: 0}]-(assign {name: "hl.assign"})
MATCH (assign)-[:ARGVALUE {idx: 1}]->()<-[:RESVALUE]-(pointee) WHERE pointee.name = 'hl.deref' OR pointee.name = 'hl.member' OR pointee.name = 'hl.subscript'
RETURN pointee;
+-------------------------------------------------------------------------------------------------+
| pointee                                                                                         |
+-------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.subscript", uid: 7533288, location: ["F", "coders/msl.c", "273", "3"]}) |
+-------------------------------------------------------------------------------------------------+

// 6. backward
MATCH (:OPERATIONS {uid: 7533288})-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def) 
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                  | def_v                    |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.param", uid: 7518489, prime_type: "typedef MSLInfo *", location: ["F", "coders/msl.c", "245", "38"], paramName: "msl_info"}) | (:VALUES {uid: 7518490}) |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
MATCH (:OPERATIONS {uid: 7541255})-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def) 
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                            | def_v                    |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 7534233, varName: "msl_info", has_init: FALSE, name: "hl.var", variable_sizes: 0, location: ["F", "coders/msl.c", "7402", "5"], hash: 2135890194688941112}) | (:VALUES {uid: 7534234}) |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 7. forward
MATCH (:VALUES {uid: 7534234}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[arg:ARGVALUE]-(call {name: "hl.call"}) 
WHERE (call.location[0] = 'F' AND toInteger(call.location[2]) > 7465) OR (call.location[0] = 'M' AND toInteger(call.location[8]) > 7465)
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT arg.idx) AS arg_idx, collect(DISTINCT call) AS calls
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, arg_idx, [call IN calls | call.uid] AS calls, [call IN calls | call.location] AS call_locs;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                                                                       | callee.location                          | callee.uid | arg_idx | calls              | call_locs                                                                |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "DestroyMSLInfo(_MSLInfo *)"                                                                                           | ["F", "coders/msl.c", "7366", "13"]      | 7522797    | [0]     | [7541520, 7554159] | [["F", "coders/msl.c", "7487", "7"], ["F", "coders/msl.c", "7523", "3"]] |
| "CloneImage(const _Image *, unsigned long, unsigned long, $enum@<./MagickCore/magick-type.h:161:9>, _ExceptionInfo *)" | ["F", "MagickCore/image.c", "792", "21"] | 2423355    | [0]     | [7554145]          | [["F", "coders/msl.c", "7522", "12"]]                                    |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 8. forward
MATCH (:OPERATIONS {uid: 7522797})-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST {idx: 0}]->(first)
MATCH (first) (()-[:NEXTOP]->(mid) WHERE mid.name <> 'hl.param'){0,} (param {name: "hl.param"})-[:RESVALUE]->(param_v)
RETURN param, param_v;
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| param                                                                                                                                                 | param_v                  |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.param", uid: 7522798, prime_type: "typedef MSLInfo *", location: ["F", "coders/msl.c", "7366", "37"], paramName: "msl_info"}) | (:VALUES {uid: 7522799}) |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
MATCH (:VALUES {uid: 7522799}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[:ARGVALUE {idx: 1}]-({name: "hl.assign"})-[:ARGVALUE {idx: 0}]->(value)
MATCH (value) (()<-[:RESVALUE]-()-[:ARGVALUE]->()){0,} ()<-[:RESVALUE]-(call {name: "hl.call"})
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+-----------------------------------------------------------------------------------------------------+
| callee.func_name                 | callee.location                            | callee.uid | macros |
+-----------------------------------------------------------------------------------------------------+
| "DestroyImage(_Image *)"         | ["F", "MagickCore/image.c", "1186", "21"]  | 2424373    | []     |
| "DestroyDrawInfo(_DrawInfo *)"   | ["F", "MagickCore/draw.c", "968", "24"]    | 1324301    | []     |
| "DestroyImageInfo(_ImageInfo *)" | ["F", "MagickCore/image.c", "1257", "25"]  | 2463129    | []     |
| "RelinquishMagickMemory(void *)" | ["F", "MagickCore/memory.c", "1198", "20"] | 2929164    | []     |
| "DestroyString(char *)"          | ["F", "MagickCore/string.c", "789", "20"]  | 4530402    | []     |
+-----------------------------------------------------------------------------------------------------+

// 9. backward
MATCH (:OPERATIONS {uid: 2424373}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (ret {name: "hl.return"})
MATCH (ret)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call" OR def.name = "hl.expr") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN DISTINCT def, def_v;
+-------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                | def_v                    |
+-------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.expr", uid: 2463118, location: ["F", "MagickCore/image.c", "1231", "9"]})  | (:VALUES {uid: 2463119}) |
| (:OPERATIONS {name: "hl.expr", uid: 2424674, location: ["F", "MagickCore/image.c", "1205", "11"]}) | (:VALUES {uid: 2424675}) |
+-------------------------------------------------------------------------------------------------------------------------------+
UNWIND [2463118, 2424674] AS uid
MATCH (:OPERATIONS {uid: uid})-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->(yield {name: "hl.value.yield"})
MATCH (yield)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                    | def_v                    |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.param", uid: 2424374, prime_type: "typedef Image *", location: ["F", "MagickCore/image.c", "1186", "41"], paramName: "image"}) | (:VALUES {uid: 2424375}) |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 10. forward
MATCH (:VALUES {uid: 2424375}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[:ARGVALUE {idx: 1}]-({name: "hl.assign"})-[:ARGVALUE {idx: 0}]->(value)
MATCH (value) (()<-[:RESVALUE]-()-[:ARGVALUE]->()){0,} ()<-[:RESVALUE]-(call {name: "hl.call"})
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, call_locs;
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                             | callee.location                            | callee.uid | call_locs                                                                                                                         |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "RelinquishMagickMemory(void *)"             | ["F", "MagickCore/memory.c", "1198", "20"] | 2929164    | [["F", "MagickCore/image.c", "1230", "19"], ["F", "MagickCore/image.c", "1216", "35"], ["F", "MagickCore/image.c", "1223", "36"]] |
| "DestroyString(char *)"                      | ["F", "MagickCore/string.c", "789", "20"]  | 4530402    | [["F", "MagickCore/image.c", "1212", "20"], ["F", "MagickCore/image.c", "1214", "22"], ["F", "MagickCore/image.c", "1218", "21"]] |
| "DestroyPixelChannelMap(_PixelChannelMap *)" | ["F", "MagickCore/pixel.c", "349", "31"]   | 3135295    | [["F", "MagickCore/image.c", "1210", "22"]]                                                                                       |
| "DestroyImageInfo(_ImageInfo *)"             | ["F", "MagickCore/image.c", "1257", "25"]  | 2463129    | [["F", "MagickCore/image.c", "1225", "23"]]                                                                                       |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+