// 1. location -> op
MATCH (n:OPERATIONS {name: "hl.member"}) WHERE n.location[1] CONTAINS 'p12_mutl' AND n.location[2] = '141' RETURN n;
+----------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                    |
+----------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.member", uid: 5384699, index: 2, location: ["F", "crypto/pkcs12/p12_mutl.c", "141", "55"]})  |
| (:OPERATIONS {name: "hl.member", uid: 5384709, index: 0, location: ["F", "crypto/pkcs12/p12_mutl.c", "141", "74"]})  |
+----------------------------------------------------------------------------------------------------------------------+

// 2. backward
MATCH (:OPERATIONS {uid: 5384709})-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def) 
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                                          | def_v                    |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 5384082, varName: "pbkdf2_salt", has_init: TRUE, name: "hl.var", variable_sizes: 0, location: ["F", "crypto/pkcs12/p12_mutl.c", "118", "30"], hash: 2033172977442215395}) | (:VALUES {uid: 5384083}) |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 3. backward from assign
MATCH (:VALUES {uid: 5384083}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[:ARGVALUE {idx: 1}]-(assign {name: "hl.assign"})
MATCH (assign)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v, mids;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                                            | def_v                    | mids                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 5384046, varName: "pbkdf2_param", has_init: TRUE, name: "hl.var", variable_sizes: 0, location: ["F", "crypto/pkcs12/p12_mutl.c", "112", "18"], hash: -4901463360638748985}) | (:VALUES {uid: 5384047}) | [(:OPERATIONS {name: "hl.cast", uid: 5384534, location: ["F", "crypto/pkcs12/p12_mutl.c", "145", "19"], castKind: 5}), (:OPERATIONS {name: "hl.cast", uid: 5384532, location: ["F", "crypto/pkcs12/p12_mutl.c", "145", "19"], castKind: 4}), (:OPERATIONS {name: "hl.member", uid: 5384530, index: 7, location: ["F", "crypto/pkcs12/p12_mutl.c", "145", "45"]}), (:OPERATIONS {name: "hl.member", uid: 5384528, index: 1, location: ["F", "crypto/pkcs12/p12_mutl.c", "145", "39"]}), (:OPERATIONS {name: "hl.cast", uid: 5384526, location: ["F", "crypto/pkcs12/p12_mutl.c", "145", "19"], castKind: 4}), (:OPERATIONS {name: "hl.member", uid: 5384524, index: 0, location: ["F", "crypto/pkcs12/p12_mutl.c", "145", "33"]}), (:OPERATIONS {name: "hl.cast", uid: 5384522, location: ["F", "crypto/pkcs12/p12_mutl.c", "145", "19"], castKind: 4}), (:OPERATIONS {name: "hl.ref", uid: 5384520, location: ["F", "crypto/pkcs12/p12_mutl.c", "145", "19"]})] |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 4. type of member access
UNWIND [5384530, 5384528, 5384524] AS uid
MATCH (:OPERATIONS {uid: uid})-[:ARGVALUE {idx: 0}]->()-[:TYPE]->() 
((mid)-[:ARG]->()){0,} (t) WHERE NOT (t)-[:ARG]->()
RETURN t, mid;
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| t                                                                                                                                                                                 | mid                                                                                                                                                                                                                                                                                        |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:TYPES {uid: 321006, cv: 0, bw: 64, has_dl: TRUE, record_name: "asn1_type_st::$union@<include/openssl/asn1.h:526:5>", type: "hl.record", align: 64, hash: -4266008761055380848}) | [(:TYPES {args: [321006], uid: 333186, has_dl: FALSE, type: "hl.lvalue", hash: 8967488912829645076})]                                                                                                                                                                                      |
| (:TYPES {uid: 321003, cv: 0, bw: 128, has_dl: TRUE, record_name: "asn1_type_st", type: "hl.record", align: 64, hash: 6041453656070213811})                                        | [(:TYPES {args: [321013], uid: 321014, bw: 64, has_dl: TRUE, align: 64, type: "hl.ptr", cvr: 0, hash: -2489763001593749056}), (:TYPES {args: [321003], uid: 321013, bw: 128, name: "typedef ASN1_TYPE", has_dl: TRUE, type: "hl.typedef", align: 64, hash: -16040915396713685, cvr: 0})]   |
| (:TYPES {uid: 593006, cv: 0, bw: 256, has_dl: TRUE, record_name: "PBKDF2PARAM_st", type: "hl.record", align: 64, hash: 2861464125038570508})                                      | [(:TYPES {args: [599021], uid: 599022, bw: 64, has_dl: TRUE, align: 64, type: "hl.ptr", cvr: 0, hash: 7988005314172971864}), (:TYPES {args: [593006], uid: 599021, bw: 256, name: "typedef PBKDF2PARAM", has_dl: TRUE, type: "hl.typedef", align: 64, hash: 7719295914222006662, cvr: 0})] |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
UNWIND [-923530089772269604, -3139697902198967868] AS hash
MATCH (typedef:OPERATIONS {hash: hash})
WITH DISTINCT typedef.location AS loc, collect(typedef)[0] AS typedef RETURN typedef;
+-------------------------------------------------------------------------------------------------------------------------------------+
| typedef                                                                                                                             |
+-------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.typedef", uid: 600012, location: ["F", "include/openssl/x509.h", "473", "3"], hash: -923530089772269604})   |
| (:OPERATIONS {name: "hl.typedef", uid: 324092, location: ["F", "include/openssl/types.h", "83", "29"], hash: -3139697902198967868}) |
+-------------------------------------------------------------------------------------------------------------------------------------+
// TODO: add hash index for cstyle-struct
UNWIND ["PBKDF2PARAM_st", "asn1_type_st"] AS str
MATCH (struct:OPERATIONS {structName: str})
WITH DISTINCT struct.location AS loc, collect(struct)[0] AS struct RETURN struct;
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| struct                                                                                                                                                             |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.struct", uid: 593005, location: ["F", "include/openssl/x509.h", "467", "16"], structName: "PBKDF2PARAM_st", non_trivial_for_calls: FALSE}) |
| (:OPERATIONS {name: "hl.struct", uid: 321002, location: ["F", "include/openssl/asn1.h", "524", "8"], structName: "asn1_type_st", non_trivial_for_calls: FALSE})    |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------+
WITH "asn1_type_st::$union@<include/openssl/asn1.h:526:5>" AS str
MATCH (struct:OPERATIONS {unionName: str})
WITH DISTINCT struct.location AS loc, collect(struct)[0] AS struct RETURN struct;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| struct                                                                                                                                                                                               |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.union", uid: 319005, unionName: "asn1_type_st::$union@<include/openssl/asn1.h:526:5>", location: ["F", "include/openssl/asn1.h", "526", "5"], non_trivial_for_calls: FALSE}) |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
