// 1. location
MATCH (n:OPERATIONS) WHERE n.func_name CONTAINS 'DestroyBilateralTLS' AND (n)-[
:CHILDREGION]->()-[:CHILDBLOCK]->() RETURN n;
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                                                                                                                                                                                                                                                                    |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 1316389, visibility: "private", fs_prototype: "(unsigned long, double **)", c_attrs: ["hl.function_signature"], fs_raw_name: "DestroyBilateralTLS", name: "hl.func", location: ["F", "MagickCore/effect.c", "859", "17"], fs_class_name: "", linkage: 7, hash: -2986442372979634182, func_name: "DestroyBilateralTLS(unsigned long, double **)"}) |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 2. caller
MATCH (:STRINGATTRS {hash: -2986442372979634182})<-[:ARGATTR]-(call {name: "hl.call"}) 
(()<-[:CHILDINST]-()<-[:CHILDBLOCK]-()<-[:CHILDREGION]-()){1,} (caller {name: "hl.func"})
WITH caller, collect(call.location) AS call_locs
RETURN caller.func_name, caller.location, caller.uid, caller.hash, call_locs;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| caller.func_name                                                                                     | caller.location                           | caller.uid | caller.hash         | call_locs                                    |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "BilateralBlurImage(const _Image *, unsigned long, unsigned long, double, double, _ExceptionInfo *)" | ["F", "MagickCore/effect.c", "900", "21"] | 1730577    | 6578159970140767307 | [["F", "MagickCore/effect.c", "1143", "11"]] |
| "AcquireBilateralTLS(unsigned long, unsigned long, unsigned long)"                                   | ["F", "MagickCore/effect.c", "873", "17"] | 1730291    | 7392002272966929805 | [["F", "MagickCore/effect.c", "895", "14"]]  |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
