// 1. location -> op
MATCH (n:OPERATIONS {name: "hl.call"}) 
WITH n, CASE WHEN n.location[0] = 'F' THEN n.location[1] ELSE n.location[3] END AS file, CASE WHEN n.location[0] = 'F' THEN n.location[2] ELSE n.location[4] END AS line
WHERE file CONTAINS 'zonemeta.cpp' AND line = '694' RETURN n;
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                                                                                |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", can_throw: TRUE, uid: 4504463, location: ["M", "2", "F", "zonemeta.cpp", "694", "25", "F", "unknown", "124", "1"], within: FALSE, cleanup: TRUE}) |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 2. backward from op
MATCH (:OPERATIONS {uid: 4504463})-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def) 
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                         | def_v                    |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 4504290, varName: "entry", has_init: TRUE, name: "hl.var", variable_sizes: 0, location: ["F", "zonemeta.cpp", "680", "42"], hash: -8481733259686664850}) | (:VALUES {uid: 4504291}) |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 3. forward to arg
MATCH (:VALUES {uid: 4504291}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[arg:ARGVALUE]-(call {name: "hl.call"})
WHERE toInteger(CASE WHEN call.location[0] = 'F' THEN call.location[2] ELSE call.location[4] END) < 694
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT arg.idx) AS arg_idx, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, arg_idx, call_locs
+-------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                        | callee.location                   | callee.uid | arg_idx | call_locs                            |
+-------------------------------------------------------------------------------------------------------------------------------------------+
| "deleteOlsonToMetaMappingEntry(void *)" | ["F", "zonemeta.cpp", "112", "1"] | 4487125    | [0]     | [["F", "zonemeta.cpp", "693", "25"]] |
+-------------------------------------------------------------------------------------------------------------------------------------------+

// 4. track path condition
// (1) the check of condition
MATCH (n:OPERATIONS {name: "hl.call"}) 
WITH n, CASE WHEN n.location[0] = 'F' THEN n.location[1] ELSE n.location[3] END AS file, CASE WHEN n.location[0] = 'F' THEN n.location[2] ELSE n.location[4] END AS line
WHERE file CONTAINS 'zonemeta.cpp' AND line = '691'
MATCH (n)-[:ARGATTR]->(str:STRINGATTRS)
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN n, callee.func_name, callee.location, collect(callee.uid)[0]
// TODO: name conflicts of static symbols
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                                          | callee.func_name        | callee.location                                     | collect(callee.uid)[0] |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", can_throw: TRUE, uid: 4504428, location: ["F", "zonemeta.cpp", "691", "25"], within: FALSE, cleanup: TRUE}) | "U_FAILURE(UErrorCode)" | ["F", "./unicode/utypes.h", "677", "18"]            | 51014                  |
| (:OPERATIONS {name: "hl.call", can_throw: TRUE, uid: 4504428, location: ["F", "zonemeta.cpp", "691", "25"], within: FALSE, cleanup: TRUE}) | "U_FAILURE(UErrorCode)" | ["F", "../common/unicode/utypes.h", "677", "18"]    | 2617380                |
| (:OPERATIONS {name: "hl.call", can_throw: TRUE, uid: 4504428, location: ["F", "zonemeta.cpp", "691", "25"], within: FALSE, cleanup: TRUE}) | "U_FAILURE(UErrorCode)" | ["F", "../../common/unicode/utypes.h", "677", "18"] | 5422051                |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
// (2) the change of condition
MATCH (n:OPERATIONS {name: "hl.call"}) 
WITH n, CASE WHEN n.location[0] = 'F' THEN n.location[1] ELSE n.location[3] END AS file, CASE WHEN n.location[0] = 'F' THEN n.location[2] ELSE n.location[4] END AS line
WHERE file CONTAINS 'zonemeta.cpp' AND line = '690'
MATCH (n)-[:ARGATTR]->(str:STRINGATTRS)
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN n, callee.func_name, callee.location, collect(callee.uid)[0]
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                                          | callee.func_name                                                                                | callee.location                  | collect(callee.uid)[0] |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", can_throw: TRUE, uid: 4504409, location: ["F", "zonemeta.cpp", "690", "38"], within: FALSE, cleanup: TRUE}) | "icu_60::UVector::UVector(void (*)(void *), signed char (*)(UElement, UElement), UErrorCode &)" | ["F", "uvector.cpp", "52", "10"] | 215164                 |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 5. forward from arg to arg
MATCH (:OPERATIONS {uid: 215164})-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST {idx: 0}]->(first)
MATCH (first) (()-[:NEXTOP]->(mid) WHERE mid.name <> 'hl.param'){0,} (first_param)
MATCH (first_param) (()-[:NEXTOP]->()){3,3} (param)-[:RESVALUE]->(param_v)
MATCH (param_v) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[arg:ARGVALUE]-(call {name: "hl.call"}) 
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT arg.idx) AS arg_idx, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, arg_idx, call_locs
+-------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                            | callee.location                  | callee.uid | arg_idx | call_locs                         |
+-------------------------------------------------------------------------------------------------------------------------------------------+
| "icu_60::UVector::_init(int, UErrorCode &)" | ["F", "uvector.cpp", "72", "15"] | 212089     | [2]     | [["F", "uvector.cpp", "59", "5"]] |
+-------------------------------------------------------------------------------------------------------------------------------------------+

// TODO: query the macro used in certain line, e.g. U_MEMORY_ALLOCATION_ERROR, U_ZERO_ERROR
