// 1. vulnerability location -> operation
MATCH (n:OPERATIONS) WHERE n.location[0] = 'M' AND n.location[3] CONTAINS 'ex_cmds2.c' AND n.location[4] = '202' AND n.location[7] CONTAINS 'macros.h' AND n.location[8] = '365' RETURN n;
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                                                                                 |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 1307624, can_throw: TRUE, location: ["M", "2", "F", "ex_cmds2.c", "202", "6", "F", "./macros.h", "365", "6"], within: FALSE, cleanup: FALSE}) |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 2. backward
MATCH (:OPERATIONS {uid: 1307624})-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-()-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def) 
WHERE def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call" RETURN def, def_v;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                         | def_v                    |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.param", uid: 1307109, prime_type: "typedef buf_T *", location: ["F", "ex_cmds2.c", "160", "12"], paramName: "buf"}) | (:VALUES {uid: 1307110}) |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 3. forward callee
MATCH (:VALUES {uid: 1307110}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[arg:ARGVALUE]-(call {name: "hl.call"}) 
WHERE (call.location[0] = 'F' AND toInteger(call.location[2]) < 200) OR (call.location[0] = 'M' AND toInteger(call.location[4]) < 200)
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT arg.idx) AS arg_idx, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, arg_idx, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                                 | callee.location                  | callee.uid | arg_idx   | macros |
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
| "dialog_msg(unsigned char *, char *, unsigned char *)"                           | ["F", "ex_docmd.c", "9813", "1"] | 1651142    | [2]       | []     |
| "check_overwrite(exarg *, file_buffer *, unsigned char *, unsigned char *, int)" | ["F", "ex_cmds.c", "2127", "1"]  | 1311833    | [1, 2, 3] | []     |
| "buf_set_name(int, unsigned char *)"                                             | ["F", "buffer.c", "3606", "1"]   | 578918     | [0]       | []     |
| "buf_write_all(file_buffer *, int)"                                              | ["F", "ex_cmds2.c", "450", "1"]  | 1335618    | [0]       | []     |
+-------------------------------------------------------------------------------------------------------------------------------------------------------+
