// 1. location
MATCH (n:OPERATIONS {name: "hl.call"}) WHERE n.location[1] CONTAINS 'msl.c' AND n.location[2] = '3388' RETURN n;
+----------------------------------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                                            |
+----------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 7855936, can_throw: TRUE, location: ["F", "coders/msl.c", "3388", "26"], within: FALSE, cleanup: FALSE}) |
+----------------------------------------------------------------------------------------------------------------------------------------------+]

// 2. callee
MATCH (call:OPERATIONS {uid: 7855936})-[:ARGATTR]->(str:STRINGATTRS)
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->()
RETURN callee.func_name, callee.location, callee.uid;
+-----------------------------------------------------------------------------------+
| callee.func_name         | callee.location                           | callee.uid |
+-----------------------------------------------------------------------------------+
| "DestroyImage(_Image *)" | ["F", "MagickCore/image.c", "1186", "21"] | 2449013    |
+-----------------------------------------------------------------------------------+

// 3. backward
MATCH (:OPERATIONS {uid: 7855936})-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def) 
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                                   | def_v                    |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 7855064, varName: "affinity_image", has_init: FALSE, name: "hl.var", variable_sizes: 0, location: ["F", "coders/msl.c", "3307", "14"], hash: 5790745783616583321}) | (:VALUES {uid: 7855065}) |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 4. forward
MATCH (:VALUES {uid: 7855065}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[:ARGVALUE {idx: 1}]-({name: "hl.assign"})-[:ARGVALUE {idx: 0}]->(value)
MATCH (value) (()<-[:RESVALUE]-()-[:ARGVALUE]->()){0,} ()<-[:RESVALUE]-(call {name: "hl.call"})
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                                                                       | callee.location                           | callee.uid | macros |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "DestroyImage(_Image *)"                                                                                               | ["F", "MagickCore/image.c", "1186", "21"] | 2449013    | []     |
| "CloneImage(const _Image *, unsigned long, unsigned long, $enum@<./MagickCore/magick-type.h:161:9>, _ExceptionInfo *)" | ["F", "MagickCore/image.c", "792", "21"]  | 2427348    | []     |
| "NewImageList()"                                                                                                       | ["F", "MagickCore/list.c", "962", "21"]   | 2694612    | []     |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
