// 1. location -> operation
MATCH (n:OPERATIONS {name: "hl.call"}) WHERE n.location[1] CONTAINS 'blob.c' AND n.location[2] = '2446' RETURN n;
+--------------------------------------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                                                |
+--------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 195204, can_throw: TRUE, location: ["F", "MagickCore/blob.c", "2446", "18"], within: FALSE, cleanup: FALSE}) |
+--------------------------------------------------------------------------------------------------------------------------------------------------+

// 2. backward from op
MATCH (:OPERATIONS {uid: 195204})-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def) 
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                            | def_v                   |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 155142, varName: "blob", has_init: FALSE, name: "hl.var", variable_sizes: 0, location: ["F", "MagickCore/blob.c", "2352", "6"], hash: -445356373192389019}) | (:VALUES {uid: 155143}) |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 3. forward
MATCH (:VALUES {uid: 155143}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[:ARGVALUE {idx: 1}]-({name: "hl.assign"})-[:ARGVALUE {idx: 0}]->(value)
MATCH (value) (()<-[:RESVALUE]-()-[:ARGVALUE]->()){0,} ()<-[:RESVALUE]-(call {name: "hl.call"})
WHERE (call.location[0] = 'F' AND toInteger(call.location[2]) < 2446) OR (call.location[0] = 'M' AND toInteger(call.location[4]) < 2446)
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, call_locs;
+-------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name          | callee.location                         | callee.uid | call_locs                                  |
+-------------------------------------------------------------------------------------------------------------------------------+
| "DetachBlob(_BlobInfo *)" | ["F", "MagickCore/blob.c", "988", "20"] | 3277       | [["F", "MagickCore/blob.c", "2402", "16"]] |
+-------------------------------------------------------------------------------------------------------------------------------+

// 4. backward from return
MATCH (:OPERATIONS {uid: 3277}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (ret {name: "hl.return"})
MATCH (ret)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call" OR def.name = "hl.expr") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN DISTINCT def, def_v;
+-----------------------------------------------------------------------------------------------------------------------+
| def                                                                                           | def_v                 |
+-----------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.expr", uid: 3700, location: ["F", "MagickCore/blob.c", "1017", "9"]}) | (:VALUES {uid: 3701}) |
+-----------------------------------------------------------------------------------------------------------------------+
// backward from value yield
MATCH (:OPERATIONS {uid: 3700})-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->(yield {name: "hl.value.yield"})
MATCH (yield)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                          | def_v                 |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 3283, varName: "data", has_init: FALSE, name: "hl.var", variable_sizes: 0, location: ["F", "MagickCore/blob.c", "994", "6"], hash: -1965939710438318818}) | (:VALUES {uid: 3284}) |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
// backward from assign
MATCH (:VALUES {uid: 3284}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[:ARGVALUE {idx: 1}]-(assign {name: "hl.assign"})
MATCH (assign)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                      | def_v                 |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.param", uid: 3278, prime_type: "typedef BlobInfo *", location: ["F", "MagickCore/blob.c", "991", "41"], paramName: "blob_info"}) | (:VALUES {uid: 3279}) |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 5. forward to call
MATCH (:VALUES {uid: 3279}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[arg:ARGVALUE]-(call {name: "hl.call"}) 
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT arg.idx) AS arg_idx, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, arg_idx, call_locs;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                                      | callee.location                             | callee.uid | arg_idx | call_locs                                  |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "UnmapBlob(void *, unsigned long)"                                                    | ["F", "MagickCore/blob.c", "5492", "32"]    | 227443     | [0, 1]  | [["F", "MagickCore/blob.c", "1001", "14"]] |
| "RelinquishMagickResource($enum@<./MagickCore/resource_.h:25:9>, unsigned long long)" | ["F", "MagickCore/resource.c", "922", "19"] | 1834854    | [1]     | [["F", "MagickCore/blob.c", "1003", "7"]]  |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
