// 1. location
MATCH (n:OPERATIONS {name: "hl.member"}) WHERE n.location[1] CONTAINS 'quic_impl.c' AND n.location[2] = '5082' RETURN n;
+--------------------------------------------------------------------------------------------------------------------+
| n                                                                                                                  |
+--------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.member", uid: 10002892, index: 13, location: ["F", "ssl/quic/quic_impl.c", "5082", "16"]}) |
+--------------------------------------------------------------------------------------------------------------------+

// 2. backward
MATCH (:OPERATIONS {uid: 10002892})-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def) 
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                                  | def_v                     |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 10002865, varName: "ciph", has_init: TRUE, name: "hl.var", variable_sizes: 0, location: ["F", "ssl/quic/quic_impl.c", "5080", "23"], hash: -2089275825676945948}) | (:VALUES {uid: 10002866}) |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 3. backward
MATCH (:OPERATIONS {uid: 10002865})-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->(yield {name: "hl.value.yield"})
MATCH (yield)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                   | def_v                     |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 10002871, can_throw: TRUE, location: ["F", "ssl/quic/quic_impl.c", "5080", "30"], within: FALSE, cleanup: FALSE}) | (:VALUES {uid: 10002872}) |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
MATCH (call {uid: 10002871})-[:ARGATTR]->(str:STRINGATTRS)
WITH str, call.location AS call_loc
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, CASE WHEN call_loc[0] = 'M' THEN call_loc ELSE NULL END AS macro;
+-------------------------------------------------------------------------------------------------------------+
| callee.func_name                                 | callee.location                     | callee.uid | macro |
+-------------------------------------------------------------------------------------------------------------+
| "ssl3_get_cipher_by_char(const unsigned char *)" | ["F", "ssl/s3_lib.c", "4683", "19"] | 9279566    | NULL  |
+-------------------------------------------------------------------------------------------------------------+

// 4. backward
MATCH (:OPERATIONS {uid: 9279566}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (ret {name: "hl.return"})
MATCH (ret)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN DISTINCT def, def_v;
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                          | def_v                    |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 9279613, can_throw: TRUE, location: ["F", "ssl/s3_lib.c", "4685", "12"], within: FALSE, cleanup: FALSE}) | (:VALUES {uid: 9279614}) |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
MATCH (call {uid: 9279613})-[:ARGATTR]->(str:STRINGATTRS)
WITH str, call.location AS call_loc
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, CASE WHEN call_loc[0] = 'M' THEN call_loc ELSE NULL END AS macro;
+--------------------------------------------------------------------------------------------------+
| callee.func_name                      | callee.location                     | callee.uid | macro |
+--------------------------------------------------------------------------------------------------+
| "ssl3_get_cipher_by_id(unsigned int)" | ["F", "ssl/s3_lib.c", "4645", "19"] | 9279133    | NULL  |
+--------------------------------------------------------------------------------------------------+

// 5. backward
MATCH (:OPERATIONS {uid: 9279133}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (ret {name: "hl.return"})
MATCH (ret)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN DISTINCT def, def_v;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                       | def_v                    |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 9279303, can_throw: TRUE, location: ["F", "ssl/s3_lib.c", "4657", "12"], within: FALSE, cleanup: FALSE})                              | (:VALUES {uid: 9279304}) |
| (:OPERATIONS {uid: 9279141, varName: "cp", has_init: FALSE, name: "hl.var", variable_sizes: 0, location: ["F", "ssl/s3_lib.c", "4648", "23"], hash: 1890516329359507747}) | (:VALUES {uid: 9279142}) |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
// forward
MATCH (:VALUES {uid: 9279142}) (()<-[:ARGVALUE]-()-[:RESVALUE]->()){0,} ()<-[:ARGVALUE {idx: 1}]-({name: "hl.assign"})-[:ARGVALUE {idx: 0}]->(value)
MATCH (value) (()<-[:RESVALUE]-()-[:ARGVALUE]->()){0,} ()<-[:RESVALUE]-(call {name: "hl.call"})
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| call                                                                                                                                         | value                    |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 9279176, can_throw: TRUE, location: ["F", "ssl/s3_lib.c", "4651", "10"], within: FALSE, cleanup: FALSE}) | (:VALUES {uid: 9279180}) |
| (:OPERATIONS {name: "hl.call", uid: 9279240, can_throw: TRUE, location: ["F", "ssl/s3_lib.c", "4654", "10"], within: FALSE, cleanup: FALSE}) | (:VALUES {uid: 9279243}) |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
// callee
// TODO: why unknown macro location
UNWIND [9279303, 9279176, 9279240] AS uid
MATCH (call:OPERATIONS {uid: uid})-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                         | callee.location                                                         | callee.uid | macros |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "OBJ_bsearch_ssl_cipher_id(ssl_cipher_st *, const ssl_cipher_st *, int)" | ["M", "2", "F", "ssl/ssl_lib.c", "6324", "1", "F", "unknown", "9", "1"] | 9693327    | []     |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 6. backward
MATCH (:OPERATIONS {uid: 9693327}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (ret {name: "hl.return"})
MATCH (ret)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN DISTINCT def, def_v;
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                                                   | def_v                    |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 9693361, can_throw: TRUE, location: ["M", "2", "F", "ssl/ssl_lib.c", "6324", "1", "F", "include/openssl/objects.h", "143", "25"], within: FALSE, cleanup: FALSE}) | (:VALUES {uid: 9693362}) |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
MATCH (call {uid: 9693361})-[:ARGATTR]->(str:STRINGATTRS)
WITH str, call.location AS call_loc
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, CASE WHEN call_loc[0] = 'M' THEN call_loc ELSE NULL END AS macro;
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                                          | callee.location                                | callee.uid | macro                                                                                        |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "OBJ_bsearch_(const void *, const void *, int, int, int (*)(const void *, const void *))" | ["F", "crypto/objects/obj_dat.c", "687", "13"] | 5093866    | ["M", "2", "F", "ssl/ssl_lib.c", "6324", "1", "F", "include/openssl/objects.h", "143", "25"] |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 7. backward
MATCH (:OPERATIONS {uid: 5093866}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (ret {name: "hl.return"})
MATCH (ret)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN DISTINCT def, def_v;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                     | def_v                    |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 5093902, can_throw: TRUE, location: ["F", "crypto/objects/obj_dat.c", "690", "12"], within: FALSE, cleanup: FALSE}) | (:VALUES {uid: 5093903}) |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
MATCH (call {uid: 5093902})-[:ARGATTR]->(str:STRINGATTRS)
WITH str, call.location AS call_loc
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, CASE WHEN call_loc[0] = 'M' THEN call_loc ELSE NULL END AS macro;
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                                                  | callee.location                                | callee.uid | macro |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "OBJ_bsearch_ex_(const void *, const void *, int, int, int (*)(const void *, const void *), int)" | ["F", "crypto/objects/obj_dat.c", "693", "13"] | 5091794    | NULL  |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

// 8. backward
MATCH (:OPERATIONS {uid: 5091794}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (ret {name: "hl.return"})
MATCH (ret)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN DISTINCT def, def_v;
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                                                 | def_v                    |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {uid: 5091812, varName: "p", has_init: TRUE, name: "hl.var", variable_sizes: 0, location: ["F", "crypto/objects/obj_dat.c", "698", "17"], hash: -4746542111220524153}) | (:VALUES {uid: 5091813}) |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
MATCH (:OPERATIONS {uid: 5091812})-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->(yield {name: "hl.value.yield"})
MATCH (yield)-[:ARGVALUE {idx: 0}]->() (()<-[:RESVALUE]-(mids)-[:ARGVALUE]->()){0,} (def_v)<-[:RESVALUE]-(def)
WHERE (def.name = "hl.param" OR def.name = "hl.var" OR def.name = "hl.call") AND NOT ANY(mid IN mids WHERE mid.name = "hl.call") RETURN def, def_v;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| def                                                                                                                                                     | def_v                    |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| (:OPERATIONS {name: "hl.call", uid: 5091838, can_throw: TRUE, location: ["F", "crypto/objects/obj_dat.c", "698", "21"], within: FALSE, cleanup: FALSE}) | (:VALUES {uid: 5091839}) |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
MATCH (call {uid: 5091838})-[:ARGATTR]->(str:STRINGATTRS)
WITH str, call.location AS call_loc
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, callee.uid, CASE WHEN call_loc[0] = 'M' THEN call_loc ELSE NULL END AS macro;
+-------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                                               | callee.location                       | callee.uid | macro |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "ossl_bsearch(const void *, const void *, int, int, int (*)(const void *, const void *), int)" | ["F", "crypto/bsearch.c", "13", "13"] | 4442009    | NULL  |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------+
