// 1. location -> function:
MATCH (n:OPERATIONS) WHERE n.location[1] CONTAINS 'variant.c' AND n.location[2] = '836' LIMIT 1
MATCH (n) (()<-[:CHILDINST]-()<-[:CHILDBLOCK]-()<-[:CHILDREGION]-()){1,} (func {name: "hl.func"}) RETURN func.uid, func.hash, func.func_name;
+----------------------------------------------------------------------------------------------------------------+
| func.uid | func.hash           | func.func_name                                                                |
+----------------------------------------------------------------------------------------------------------------+
| 654897   | 8824966477248709111 | "tr_variantWalk(const tr_variant *, const VariantWalkFuncs *, void *, _Bool)" |
+----------------------------------------------------------------------------------------------------------------+

// 2. callee
// NOTE: a static function definition in header may causes the function has multiple ops
MATCH (callee:OPERATIONS {uid: 654897}) (()-[:CHILDREGION]->()-[:CHILDBLOCK]->()-[:CHILDINST]->()){1,} (call {name: 'hl.call'})
MATCH (call)-[:ARGATTR]->(str:STRINGATTRS)
WITH str, collect(DISTINCT call.location) AS call_locs
MATCH (callee:OPERATIONS {name: "hl.func"}) WHERE callee.hash = str.hash AND (callee)-[:CHILDREGION]->()-[:CHILDBLOCK]->() 
RETURN callee.func_name, callee.location, collect(callee.uid)[0] AS uid, [loc IN call_locs WHERE loc[0] = 'M' | loc] AS macros;
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| callee.func_name                                                                                                                                                           | callee.location                                                                                            | uid    | macros                                                                                                                                                                                                                                                                                                                                                                                                                                                       |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| "tr_free(void *)"                                                                                                                                                          | ["F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/utils.c", "148", "6"]    | 640038 | []                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| "nodeConstruct(SaveNode *, const tr_variant *, _Bool)"                                                                                                                     | ["F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/variant.c", "766", "13"] | 654442 | []                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| "tr_malloc(unsigned long)"                                                                                                                                                 | ["F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/utils.c", "126", "7"]    | 637041 | [["M", "2", "F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/variant.c", "822", "30", "F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/utils.h", "174", "20"]]                                                                                                                                                                                                                               |
| "nodeDestruct(SaveNode *)"                                                                                                                                                 | ["F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/variant.c", "805", "13"] | 654837 | []                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| "tr_variantIsContainer(const tr_variant *)"                                                                                                                                | ["F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/variant.c", "112", "13"] | 655021 | []                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| "tr_variantIsDict(const tr_variant *)"                                                                                                                                     | ["F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/variant.h", "239", "20"] | 59279  | []                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| "tr_variantInitQuark(tr_variant *, unsigned long)"                                                                                                                         | ["F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/variant.c", "465", "6"]  | 657321 | []                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| "tr_realloc(void *, unsigned long)"                                                                                                                                        | ["F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/utils.c", "136", "7"]    | 637139 | [["M", "2", "F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/variant.c", "910", "33", "F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/utils.h", "180", "20"], ["M", "2", "F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/variant.c", "892", "33", "F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/utils.h", "180", "20"]] |
| "tr_logLevelIsActive($enum@</home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/transmission.h:722:9>)"                                             | ["F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/log.h", "25", "20"]      | 29113  | [["M", "2", "F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/variant.c", "920", "17", "F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/log.h", "36", "13"]]                                                                                                                                                                                                                                  |
| "tr_logAddMessage(const char *, int, $enum@</home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/transmission.h:722:9>, const char *, const char *)" | ["F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/log.c", "213", "6"]      | 216418 | [["M", "2", "F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/variant.c", "920", "17", "F", "/home/yibozhang/src/mlir/cxx-real/src/transmission-a6482b0/libtransmission/log.h", "38", "13"]]                                                                                                                                                                                                                                  |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
